In [3]:
import pandas as pd
import numpy as np

# Creando un DataFrame usando arrays
### Opcion 1

In [4]:
# Creando un array
data = np.array([[1, 4], [2, 5], [3, 6]])

In [5]:
# Creando un dataframe
df = pd.DataFrame(data, index = ['row1', 'row2', 'row3'], columns = ['col1', 'col2'])

In [6]:
# Mostrando dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

### Opcion 2

In [7]:
# Creando un array con una lista
data = [[1, 4], [2, 5], [3, 6]]

In [8]:
# Creando un dataframe
df = pd.DataFrame(data, index = ['row1', 'row2', 'row3'], columns = ['col1', 'col2'])

In [9]:
# Mostrando el dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# Creando un dataframe desde un diccionario

In [10]:
#Listas usadas en el ejemplo
estados = ["California", "Texas", "Florida", "New York"]
poblacion = [39613493, 29730311, 21944577, 19299981]

In [11]:
# Uniendo listas para crear el diccionario
diccionarioEstados = {'Estados': estados, 'Poblacion': poblacion}

In [12]:
# Creando el dataframe
dfPoblacion = pd.DataFrame(diccionarioEstados)

In [13]:
# Mostrando dataframe
dfPoblacion

      Estados  Poblacion
0  California   39613493
1       Texas   29730311
2     Florida   21944577
3    New York   19299981

# Creando un DataFrame desde un archivo CSV

In [14]:
# Leyendo archivo CSV
dfExamenes = pd.read_csv('DesempenioEstudiantes.csv')

In [15]:
# Mostrando dataframe
dfExamenes

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86